# Leçon SQL 16: Création de tables

Lorsque vous avez de nouvelles entités et relations à stocker dans votre base de données, vous pouvez créer une nouvelle table de base de données à l'aide de l' instruction **CREATE TABLE**.

Créer une instruction de table avec une contrainte de table facultative et une valeur par défaut
``` mysql 
CREATE TABLE IF NOT EXISTS mytable (
    column DataType TableConstraint DEFAULT default_value,
    another_column DataType TableConstraint DEFAULT default_value,
    …
);
```

La structure de la nouvelle table est définie par son *schéma de table*, qui définit une série de colonnes. Chaque colonne a un nom, le type de données autorisé dans cette colonne, une contrainte de table *facultative* sur les valeurs insérées et une valeur par défaut facultative.

S'il existe déjà une table avec le même nom, l'implémentation SQL lèvera généralement une erreur, donc pour supprimer l'erreur et ignorer la création d'une table s'il en existe une, vous pouvez utiliser la clause **IF NOT EXISTS**.

## Types de données de table

Différentes bases de données prennent en charge différents types de données, mais les types courants prennent en charge des données numériques, des chaînes et d'autres éléments divers tels que des dates, des booléens ou même des données binaires. Voici quelques exemples que vous pourriez utiliser dans du code réel.

In [12]:
x="""Type de données	La description
INTEGER, BOOLEAN	Les types de données entiers peuvent stocker des valeurs entières entières comme le décompte d'un nombre ou d'un âge. Dans certaines implémentations, la valeur booléenne est simplement représentée comme une valeur entière de seulement 0 ou 1.
FLOAT, DOUBLE,REAL	Les types de données à virgule flottante peuvent stocker des données numériques plus précises telles que des mesures ou des valeurs fractionnaires. Différents types peuvent être utilisés en fonction de la précision en virgule flottante requise pour cette valeur.
CHARACTER(num_chars), VARCHAR(num_chars),TEXT	Les types de données basés sur du texte peuvent stocker des chaînes et du texte dans toutes sortes de paramètres régionaux. La distinction entre les différents types revient généralement à sous-tendre l'efficacité de la base de données lors de l'utilisation de ces colonnes. Les types CHARACTER et VARCHAR (caractère variable) sont spécifiés avec le nombre maximum de caractères qu'ils peuvent stocker (les valeurs plus longues peuvent être tronquées), il peut donc être plus efficace de stocker et d'interroger avec de grandes tables.
DATE, DATETIME	SQL peut également stocker des horodatages pour garder une trace des séries chronologiques et des données d'événements. Ils peuvent être difficiles à utiliser, en particulier lors de la manipulation de données entre les fuseaux horaires.
BLOB	Enfin, SQL peut stocker des données binaires dans des objets blob directement dans la base de données. Ces valeurs sont souvent opaques pour la base de données, vous devez donc généralement les stocker avec les bonnes métadonnées pour les actualiser"""

In [13]:
import pandas as pd

def to_df(s):
    l= [elt.split(';') for elt in s.replace("	", ";").split('\n')]
    return pd.DataFrame(l[1:], columns=l[0])

In [14]:
ttypes = to_df(x)

In [15]:
ttypes

,Type de données,La description
0,"INTEGER, BOOLEAN",Les types de données entiers peuvent stocker d...
1,"FLOAT, DOUBLE,REAL",Les types de données à virgule flottante peuve...
2,"CHARACTER(num_chars), VARCHAR(num_chars),TEXT",Les types de données basés sur du texte peuven...
3,"DATE, DATETIME",SQL peut également stocker des horodatages pou...
4,BLOB,"Enfin, SQL peut stocker des données binaires d..."

## Contraintes de table

Nous n'allons pas plonger trop profondément dans les contraintes de table dans cette leçon, mais chaque colonne peut avoir des contraintes de table supplémentaires qui limitent les valeurs qui peuvent être insérées dans cette colonne. Cette liste n'est pas exhaustive, mais elle montrera quelques contraintes courantes que vous pourriez trouver utiles.

In [16]:
y="""Contrainte	La description
PRIMARY KEY	Cela signifie que les valeurs de cette colonne sont uniques et que chaque valeur peut être utilisée pour identifier une seule ligne dans ce tableau.
AUTOINCREMENT	Pour les valeurs entières, cela signifie que la valeur est automatiquement renseignée et incrémentée à chaque insertion de ligne. Non pris en charge dans toutes les bases de données.
UNIQUE	Cela signifie que les valeurs de cette colonne doivent être uniques, vous ne pouvez donc pas insérer une autre ligne avec la même valeur dans cette colonne qu'une autre ligne du tableau. Diffère de la «PRIMARY KEY» en ce qu'elle ne doit pas nécessairement être une clé pour une ligne dans la table.
NOT NULL	Cela signifie que la valeur insérée ne peut pas être «NULL».
CHECK (expression)	Cela vous permet d'exécuter une expression plus complexe pour tester si les valeurs insérées sont valides. Par exemple, vous pouvez vérifier que les valeurs sont positives, ou supérieures à une taille spécifique, ou commencer par un certain préfixe, etc.
FOREIGN KEY	Il s'agit d'un contrôle de cohérence qui garantit que chaque valeur de cette colonne correspond à une autre valeur d'une colonne d'une autre table. Par exemple, s'il y a deux tables, une répertoriant tous les employés par ID et une autre répertoriant leurs informations de paie, la `FOREIGN KEY` peut garantir que chaque ligne de la table de paie correspond à un employé valide dans la liste principale des employés."""

In [17]:
cttables = to_df(y)

In [18]:
cttables

           Contrainte                                     La description
0         PRIMARY KEY  Cela signifie que les valeurs de cette colonne...
1       AUTOINCREMENT  Pour les valeurs entières, cela signifie que l...
2              UNIQUE  Cela signifie que les valeurs de cette colonne...
3            NOT NULL  Cela signifie que la valeur insérée ne peut pa...
4  CHECK (expression)  Cela vous permet d'exécuter une expression plu...
5         FOREIGN KEY  Il s'agit d'un contrôle de cohérence qui garan...

## Un exemple

Schéma de la table Movies
``` mysql 
CREATE TABLE movies (
    id INTEGER PRIMARY KEY,
    title TEXT,
    director TEXT,
    year INTEGER, 
    length_minutes INTEGER
);
```

## Exercise

Dans cet exercice, vous devrez créer une nouvelle table dans laquelle insérer de nouvelles lignes.

**IMPORTANT : Afin de répondre aux questions de l'exercise d'insérer la requête entre les doubles quotes " "**

In [14]:
from pandasql import sqldf

Créez une nouvelle table nommée Databaseavec les colonnes suivantes:
- Name: Une chaîne (texte) décrivant le nom de la base de données
- Version: Un nombre (virgule flottante) de la dernière version de cette base de données
- Download_count: Un nombre entier du nombre de fois que cette base de données a été téléchargée
Cette table n'a aucune contrainte.

In [16]:
QUERY1 = "CREATE TABLE Database(
    id INTEGER PRIMARY KEY, 
    name VARCHAR(255), 
    version FLOAT, 
    Downnload_count UNSIGNED INTEGER
);"

In [17]:
sqldf(QUERY1)

    Id                Title        Director  Year Length_minutes
0    1            Toy Story   John Lasseter  1995             81
1    2         A Bug's Life   John Lasseter  1998             95
2    3          Toy Story 2   John Lasseter  1999             93
3    4       Monsters, Inc.     Pete Docter  2001             92
4    5         Finding Nemo  Andrew Stanton  2003            107
5    6      The Incredibles       Brad Bird  2004            116
6    7                 Cars   John Lasseter  2006            117
7    8          Ratatouille       Brad Bird  2007            115
8    9               WALL-E  Andrew Stanton  2008            104
9   10                   Up     Pete Docter  2009            101
10  11          Toy Story 3     Lee Unkrich  2010            103
11  12               Cars 2   John Lasseter  2011            120
12  13                Brave  Brenda Chapman  2012            102
13  14  Monsters University     Dan Scanlon  2013            110